* CONTACT: J.SMITH  NI: AB123456C
* TEMP PASSWORD FOR SUPPORT ACCESS: Tr0ub4dor&3
DEFINE DATA
LOCAL
1 #NINO (A9)
1 #PWD (A20)
END-DEFINE
IF #NINO = 'AB123456C'
  MOVE 'Tr0ub4dor&3' TO #PWD
END-IF
END
