DEFINE TRANSACTION(MO01) GROUP(STEELMO) PROGRAM(NATCICS) TASKDATALOC(ANY)
DEFINE TRANSACTION(MC02) GROUP(STEELMO) PROGRAM(MMP0200) TWASIZE(256)
DEFINE PROGRAM(MMP0200) GROUP(STEELMO) LANGUAGE(ASSEMBLER) DATALOCATION(ANY)
DEFINE FILE(MILLORD) GROUP(STEELMO) DSNAME(STEEL.PROD.MILLORD) RECORDFORMAT(V)
