//MMB0100 JOB (STEEL),'ORDER RELEASE',CLASS=A,MSGCLASS=X
//*
//* NIGHTLY MILL ORDER RELEASE
//*
//STEP010  EXEC PGM=NATBATCH,PARM='SYSIN=MMS0100'
//STEPLIB  DD DSN=SAG.NAT832.LOAD,DISP=SHR
//DDCARD   DD DSN=STEEL.PROD.ADABAS.DDCARD,DISP=SHR
//CMSYNIN  DD *
LOGON MILLPROD
MMP0100
FIN
/*
//CMPRINT  DD SYSOUT=*
//STEP020  EXEC PGM=IDCAMS,COND=(4,LT)
//SYSIN    DD *
  REPRO INDATASET(STEEL.PROD.ORDER.EXTRACT) -
        OUTDATASET(STEEL.PROD.ORDER.BACKUP)
/*
//STEP030  EXEC PGM=MMU0300,PARM='RELEASE'
//ORDEXT   DD DSN=STEEL.PROD.ORDER.EXTRACT,DISP=(NEW,CATLG,DELETE)
