** MMP0200 - CERTIFICATE ENQUIRY (ONLINE)
DEFINE DATA LOCAL
1 CERT-VIEW VIEW OF MILL-CERT
  2 CERT-NO
  2 HEAT-NO
  2 CAST-DATE
1 #CERT-NO (A12)
1 #PGM (A8)
END-DEFINE
*
INPUT USING MAP 'MMM0200'
IF #CERT-NO = ' '
  REINPUT FULL 'Certificate number is required' MARK 1
END-IF
FIND (1) CERT-VIEW WITH CERT-NO = #CERT-NO
  IF NO RECORDS FOUND
    REINPUT 'No certificate found for that number'
  END-NOREC
  DISPLAY CERT-VIEW.HEAT-NO CERT-VIEW.CAST-DATE
END-FIND
MOVE 'MMP0300' TO #PGM
FETCH RETURN #PGM
CALL 'PDFGEN' #CERT-NO
ON ERROR
  WRITE 'Unexpected error' *ERROR-NR
END-ERROR
END
